inutilizacao.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soap:Header><nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeInutilizacao2"><cUF>51</cUF><versaoDados>2.00</versaoDados></nfeCabecMsg></soap:Header><soap:Body><nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeInutilizacao2"><inutNFe xmlns="http://www.portalfiscal.inf.br/nfe" versao="2.00"><infInut Id="ID511501882109000162651110"><tpAmb>2</tpAmb><xServ>INUTILIZAR</xServ><cUF>51</cUF><ano>15</ano><CNPJ>01882109000162</CNPJ><mod>65</mod><serie>1</serie><nNFIni>1</nNFIni><nNFFin>10</nNFFin><xJust>Client Test 30/04/2015 09:10:59</xJust></infInut></inutNFe></nfeDadosMsg></soap:Body></soap:Envelope>