src/main/java/br/com/linepack/classes/newXMLDocument.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
    <S:Header>
        <ns3:nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe" xmlns:ns2="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="http://www.portalfiscal.inf.br/nfe/wsdl/NfeInutilizacao2">
            <ns3:cUF>41</ns3:cUF>
            <ns3:versaoDados>2.00</ns3:versaoDados>
        </ns3:nfeCabecMsg>
    </S:Header>
    <S:Body>
        <ns3:nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe" xmlns:ns2="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="http://www.portalfiscal.inf.br/nfe/wsdl/NfeInutilizacao2">
            <inutNFe versao="2.00">
                <infInut Id="ID41141302171500017255001000000001000000001">
                    <tpAmb>2</tpAmb>
                    <xServ>INUTILIZAR</xServ>
                    <cUF>41</cUF>
                    <ano>14</ano>
                    <CNPJ>13021715000172</CNPJ>
                    <mod>55</mod>
                    <serie>001</serie>
                    <nNFIni>000000001</nNFIni>
                    <nNFFin>000000001</nNFFin>
                    <xJust>Teste de inutilização</xJust>
                </infInut>
            </inutNFe>
        </ns3:nfeDadosMsg>
    </S:Body>
</S:Envelope>--------------------

<env:Envelope xmlns:env='http://www.w3.org/2003/05/soap-envelope'>
    <env:Header xmlns:env='http://www.w3.org/2003/05/soap-envelope'>
        <nfeCabecMsg xmlns='http://www.portalfiscal.inf.br/nfe'>
            <cUF>41</cUF>
            <versaoDados>2.00</versaoDados>
        </nfeCabecMsg>
    </env:Header>
    <env:Body xmlns:env='http://www.w3.org/2003/05/soap-envelope'>
        <nfeInutilizacaoNF2Result xmlns='http://www.portalfiscal.inf.br/nfe/wsdl/NfeInutilizacao2'>
            <retInutNFe versao='2.00' xmlns='http://www.portalfiscal.inf.br/nfe'>
                <infInut>
                    <tpAmb>2</tpAmb>
                    <verAplic>PR-v2_8_7</verAplic>
                    <cStat>215</cStat>
                    <xMotivo>Falha no schema XML. org.xml.sax.SAXParseException; lineNumber: 1; columnNumber: 250; cvc-pattern-valid: Value &apos;001&apos; is not facet-valid with respect to pattern &apos;0|[1-9]{1}[0-9]{0,2}&apos; for type &apos;TSerie&apos;.</xMotivo>
                    <cUF>41</cUF>
                </infInut>
            </retInutNFe>
        </nfeInutilizacaoNF2Result>
    </env:Body>
</env:Envelope>--------------------